; domain
(define
    (domain cube3)
    (:requirements :strips :adl :typing :conditional-effects )
    (:predicates
        (cube1 ?x ?y ?z)
        (cube2 ?x ?y ?z)
        (cube3 ?x ?y ?z)
        (cube4 ?x ?y ?z)
        (cube5 ?x ?y ?z)
        (cube6 ?x ?y ?z)
        (cube7 ?x ?y ?z)
        (cube8 ?x ?y ?z)
        (edge12 ?y ?z)
        (edge13 ?x ?z)
        (edge15 ?x ?y)
        (edge26 ?x ?y)
        (edge24 ?x ?z)
        (edge48 ?x ?y)
        (edge34 ?y ?z)
        (edge37 ?x ?y)
        (edge56 ?y ?z)
        (edge57 ?x ?z)
        (edge68 ?x ?z)
        (edge78 ?y ?z)
    )

    (:action R
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube7 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube8 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube6 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube5 ?y ?x ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge78 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge68 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge56 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge57 ?y ?z))))

        )
    )

    (:action R2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube8 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube6 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube5 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube7 ?x ?y ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge68 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge56 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge57 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge78 ?y ?z))))

        )
    )

    (:action Rrev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube6 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube8 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube7 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube5 ?y ?x ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge56 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge57 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge78 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge68 ?y ?z))))

        )
    )

    (:action L
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) 
                (and (not (cube1 ?x ?y ?z)) (cube2 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) 
                (and (not (cube3 ?x ?y ?z)) (cube1 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) 
                (and (not (cube4 ?x ?y ?z)) (cube3 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) 
                (and (not (cube2 ?x ?y ?z)) (cube4 ?y ?x ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) 
                (and (not (edge13 ?x ?z)) (edge12 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) 
                (and (not (edge34 ?y ?z)) (edge13 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) 
                (and (not (edge24 ?x ?z)) (edge34 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) 
                (and (not (edge12 ?y ?z)) (edge24 ?y ?z))))

        )
    )

    (:action L2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube4 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube2 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube1 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube3 ?x ?y ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge24 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge12 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge13 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge34 ?y ?z))))

        )
    )

    (:action Lrev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube3 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube4 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube2 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube1 ?y ?x ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge34 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge24 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge12 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge13 ?y ?z))))

        )
    )

    (:action D
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube6 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube8 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube4 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube2 ?x ?z ?y))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge68 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge48 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge24 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge26 ?x ?z))))

        )
    )

    (:action D2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube8 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube4 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube2 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube6 ?x ?y ?z))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge48 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge24 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge26 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge68 ?x ?z))))

        )
    )

    (:action Drev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube4 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube8 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube6 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube2 ?x ?z ?y))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge24 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge26 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge68 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge48 ?x ?z))))
        )
    )

    (:action U
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube3 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube1 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube5 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube7 ?x ?z ?y))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge13 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge15 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge57 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge37 ?x ?z))))
        )
    )

    (:action U2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube7 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube3 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube1 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube5 ?x ?y ?z))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge37 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge13 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge15 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge57 ?x ?z))))
        )
    )

    (:action Urev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube5 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube7 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube3 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube1 ?x ?z ?y))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge57 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge37 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge13 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge15 ?x ?z))))
        )
    )

    (:action F
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube5 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube6 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube2 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube1 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge56 ?y ?x))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge26 ?z ?y))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge12 ?y ?x))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge15 ?z ?y))))

        )
    )

    (:action F2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube6 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube2 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube1 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube5 ?x ?y ?z) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge26 ?x ?y))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge12 ?y ?z))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge15 ?x ?y))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge56 ?y ?z))))

        )
    )

    (:action Frev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube2 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube6 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube5 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube1 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge12 ?y ?x))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge15 ?z ?y))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge56 ?y ?x))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge26 ?z ?y))))

        )
    )

    (:action B
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube4 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube3 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube7 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube8 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge34 ?y ?x))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge37 ?z ?y))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge78 ?y ?x))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge48 ?z ?y))))
        )
    )

    (:action B2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube8 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube4 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube3 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube7 ?x ?y ?z) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge48 ?x ?y))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge34 ?y ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge37 ?x ?y))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge78 ?y ?z))))
        )
    )

    (:action Brev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube7 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube8 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube4 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube3 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge78 ?y ?x))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge48 ?z ?y))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge34 ?y ?x))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge37 ?z ?y))))
        )
    )

)

; problem
(define
    (problem problem_4_1)
    (:domain cube3)
    (:objects Y W B G O R)
    (:init
 (cube1 G W R)
(cube2 B O W)
(cube3 O Y G)
(cube4 B R W)
(cube5 G W O)
(cube6 R B Y)
(cube7 O Y B)
(cube8 R G Y)
(edge12 W R)
(edge13 R Y)
(edge15 G W)
(edge24 O B)
(edge26 R B)
(edge34 Y G)
(edge37 O Y)
(edge48 R G)
(edge56 W O)
(edge57 B W)
(edge68 O G)
(edge78 Y B)
        
    )
    (:goal
        (and
            (cube1 R W B)
            (cube2 O W B)
            (cube3 R Y B)
            (cube4 O Y B)
            (cube5 R W G)
            (cube6 O W G)
            (cube7 R Y G)
            (cube8 O Y G)

            (edge12 W B)
            (edge24 O B)
            (edge34 Y B)
            (edge13 R B)

            (edge15 R W)
            (edge26 O W)
            (edge48 O Y)
            (edge37 R Y)

            (edge56 W G)
            (edge68 O G)
            (edge78 Y G)
            (edge57 R G)
 
        )
    )
)

; plan
1. (f2)
   deleted: (cube1 g w r) (cube5 g w o) (cube6 r b y) (cube2 b o w) (edge15 g w) (edge56 w o) (edge26 r b) (edge12 w r)
   added: (cube6 g w r) (cube2 g w o) (cube1 r b y) (cube5 b o w) (edge26 g w) (edge12 w o) (edge15 r b) (edge56 w r)
   goals met: 2 of 20
2. (b2)
   deleted: (cube3 o y g) (cube7 o y b) (cube8 r g y) (cube4 b r w) (edge37 o y) (edge78 y b) (edge48 r g) (edge34 y g)
   added: (cube8 o y g) (cube4 o y b) (cube3 r g y) (cube7 b r w) (edge48 o y) (edge34 y b) (edge37 r g) (edge78 y g)
   goals met: 7 of 20
3. (u)
   deleted: (cube1 r b y) (cube5 b o w) (cube7 b r w) (cube3 r g y) (edge15 r b) (edge57 b w) (edge37 r g) (edge13 r y)
   added: (cube3 r y b) (cube1 b w o) (cube5 b w r) (cube7 r y g) (edge13 r b) (edge15 b w) (edge57 r g) (edge37 r y)
   goals met: 12 of 20
4. (frev)
   deleted: (cube1 b w o) (cube2 g w o) (cube6 g w r) (cube5 b w r) (edge15 b w) (edge56 w r) (edge26 g w) (edge12 w o)
   added: (cube2 o w b) (cube6 o w g) (cube5 r w g) (cube1 r w b) (edge12 w b) (edge15 r w) (edge56 w g) (edge26 o w)
   goals met: 20 of 20
